/**
*  @file stations.cpp
*
*  Created on: 05.04.2014
*  Copyright (c) 2014 by Anton Gusev aka AHTOXA
**/

#include "stations.h"

const Station stations[] =
{
	{ 87800000,   "Спорт FM",        "87.8" },     // Уфинская телебашня
	{ 88200000,   "Вести FM",        "88.2" },     // Радиоцентр Алтай
	{ 90600000,   "Детское радио",   "90.6" },     // Радиоцентр Алтай
	{ 91100000,   "Эхо Москвы",      "91.1" },     // Черниковка, башня СТБ
	{ 91500000,   "DFM Радио",       "91.5" },     // Черниковка, башня СТБ
	{ 101200000,  "Маяк",           "101.2" },     // Черниковка, башня СТБ
	{ 101600000,  "Первый канал",   "101.6" },     // Радиоцентр Алтай
	{ 102500000,  "Шансон",         "102.5" },     // просп. Октября 128/3
//	{ 103000000,  "Роксана",        "103.0" },     // ул. Комсомольская 135
	{ 103500000,  "Relax FM",       "103.5" },     // ул. Менделеева 140
	{ 104000000,  "Ретро FM",       "104.0" },     // Радиоцентр Алтай
	{ 104500000,  "Русское Радио",  "104.5" },     // ул. Энтузиастов
	{ 105000000,  "Радио Дача",     "105.0" },     // Дымовая труба КЦ-13
	{ 105500000,  "Юлдаш FM",       "105.5" },     // Уфинская телебашня
	{ 106000000,  "Европа Плюс",    "106.0" },     // Дымовая труба КЦ-13
	{ 106500000,  "Авторадио",      "106.5" },     // ул. Энтузиастов
	{ 107000000,  "Спутник FM",     "107.0" },     // Уфинская телебашня
	{ 107500000,  "Business FM",    "107.5" },     // Радиоцентр Алтай
	{ 107900000,  "Дорожное радио", "107.9" }      // Радиоцентр Алтай
};

const int stationCount = sizeof(stations)/sizeof(stations[0]);
